
/* Задача 40: Напишите программу, которая принимает на вход три числа и проверяет, может ли существовать треугольник с сторонами такой длины.
Теорема о неравенстве треугольника: каждая сторона треугольника меньше суммы двух других сторон.
Задача 42: Напишите программу, которая будет преобразовывать десятичное число в двоичное.
45 -> 101101
3  -> 11
2  -> 10 */

/* Console.WriteLine("Введите длину первой стороны");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите длину второй стороны");
int b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите длину третьей стороны");
int c = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(IsReal(a,b,c));

bool IsReal(int a, int b, int c)
{
    bool t = false;
     if (a<b+c && b<a+c && c<a+b)
    {
         t = true;              
    }
     return t;
}  */

/* Задача 44: Не используя рекурсию, выведите первые N чисел Фибоначчи. Первые два числа Фибоначчи: 0 и 1.
Если N = 5 -> 0 1 1 2 3
Если N = 3 -> 0 1 1
Если N = 7 -> 0 1 1 2 3 5 8 */
/* 
Задача НЕГАФИБОНАЧЧИ. Задайте число. Составьте массив чисел НегаФибоначчи, в том числе для отрицательных индексов.
*Пример:*
- для k = 9 массив будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] */
