//Напишите программу, которая по заданному номеру четверти, 
//показывает диапазон возможных координат точек в этой четверти (x и y).





/* string CheckCoord(int x)
{
    if (x==1)
        Console.WriteLine("X>0 и Y>0");
    else if (x==2)
        Console.WriteLine("X>0 и Y<0");
    else if (x==3)
        Console.WriteLine("X<0 и Y<0");
    else if (x==4)
        Console.WriteLine("X<0 и Y>0");
    else
        Console.WriteLine("The point is located on the coordinate axis"); */
/*  Console.WriteLine("Введите номер четверти");
int x = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(CheckCoord(x)); 




string CheckCoord(int x)
{
    string res = "0";
    if (x==1)
        res = "X>0 и Y>0";
    else if (x==2)
        res = "X>0 и Y>0";
    else if (x==3)
        res = "X>0 и Y>0";
    else if (x==4)
        res = "X>0 и Y>0";
    return res;
}


try
{
    // Код, который может вызвать исключение
}
catch 
{
    // Код для обработки исключения
} */